<h1 style="text-align:center">Roteiro de Teste para a Avalia&ccedil;&atilde;o da Linguagem EvaML e do simulador EvaSIM</h1>

<hr />
<p>&nbsp;</p>

<p><span style="color:#000000"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium"><strong>TERMO DE CONSENTIMENTO LIVRE E ESCLARECIDO</strong></span></span></span></p>

<p>&nbsp;</p>

<p><span style="color:#000000"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium">Universidade Federal Fluminense/IC - Instituto de Computa&ccedil;&atilde;o</span></span></span><br />
&nbsp;</p>

<p style="text-align:justify"><span style="color:#000000"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium">Voc&ecirc; est&aacute; sendo convidado a participar de um estudo para avaliar a linguagem EvaML e o software simulador EvaSIM. Trata-se de uma pesquisa realizada pelo aluno de p&oacute;s-gradua&ccedil;&atilde;o Marcelo Marques da Rocha, orientado pela professora Dra. D&eacute;bora Christina Muchaluat Saade.</span></span></span></p>

<p style="text-align:justify"><span style="color:#000000"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium">Se desejar continuar participando, continue a leitura e realize as atividades propostas. Muito obrigado!</span></span></span></p>

<p style="text-align:justify">&nbsp;</p>

<hr />
<p style="text-align:justify">&nbsp;</p>

<p style="text-align:justify"><span style="color:#000000"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium">O rob&ocirc; <strong>EVA</strong> (Embodied Voice Assistant) &eacute; um rob&ocirc; social e foi desenvolvido originalmente por pesquisadores do CICESE (Centro de Investigaci&oacute;n Cient&iacute;fica y de Educaci&oacute;n Superior de Ensenada), em Baja California no M&eacute;xico. O rob&ocirc; EVA &eacute; uma plataforma de rob&oacute;tica <em>open-source</em> destinada a auxiliar como ferramenta de apoio &agrave; pesquisa em Intera&ccedil;&atilde;o Humano-Rob&ocirc; (IHR).</span></span></span></p>

<p style="text-align:justify"><span style="color:#000000"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium">O objetivo deste teste &eacute; a cria&ccedil;&atilde;o de uma sess&atilde;o interativa para o rob&ocirc; EVA usando os elementos definidos na linguagem EvaML, baseada em XML. O processo de desenvolvimento dos scripts para o rob&ocirc; EVA ser&aacute; usado como objeto de avalia&ccedil;&atilde;o da linguagem EvaML. O teste ser&aacute; dividido em 3 tarefas menores que utilizar&atilde;o os elementos da linguagem de forma progressiva. Ao finalizar as 3 tarefas, a sess&atilde;o interativa deve ser similar &agrave; dispon&iacute;vel neste </span></span></span><a href="https://www.youtube.com/watch?v=uDkwUEX8IeA" target="_blank"><span style="color:#1155cc"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium"><u>link</u></span></span></span></a><span style="color:#000000"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium"> </span></span></span><span style="color:#000000"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium">(idioma do v&iacute;deo: ingl&ecirc;s).</span></span></span><span style="color:#000000"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium"> Antes de come&ccedil;ar a executar as tarefas sugeridas, recomenda-se ler o </span></span></span><a href="https://github.com/midiacom/eva-robot/blob/master/EvaML-Reference-Manual/EvaML-Reference-Manual.pdf" target="_blank"><span style="color:#1155cc"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium"><u>manual da linguagem EvaML</u></span></span></span></a><span style="color:#000000"> &nbsp;<span style="font-family:Montserrat,sans-serif"><span style="font-size:medium">e instalar o parser EvaML e o simulador EvaSIM.</span></span></span></p>

<p style="text-align:justify"><span style="color:#000000; font-family:Montserrat,sans-serif; font-size:medium">A seguir ser&atilde;o apresentados os passos para a configura&ccedil;&atilde;o do ambiente adequado para o desenvolvimento do teste:</span></p>

<ol>
	<li style="text-align:justify"><span style="color:#000000; font-family:Montserrat,sans-serif; font-size:medium">IDE Visual Studio Code (Linux ou Windows)</span>

	<ul>
		<li style="text-align:justify">
		<p>Voc&ecirc; deve baixar e instalar&nbsp;a IDE&nbsp;Visual Studio Code a partir deste endere&ccedil;o:&nbsp;<a href="https://code.visualstudio.com/" target="_blank">https://code.visualstudio.com/</a>.</p>
		</li>
	</ul>
	</li>
	<li style="text-align:justify"><span style="color:#000000; font-family:Montserrat,sans-serif; font-size:medium">Plugin&nbsp;</span><span style="color:#000000; font-family:Montserrat,sans-serif; font-size:medium">XML Language Support by Red Hat instalado no VScode</span>
	<ul>
		<li style="text-align:justify">
		<p>A linguagem EvaML &eacute; uma linguagem baseada em XML e exige uma formata&ccedil;&atilde;o adequada da sua estrutura, elementos e atributos. A utiliza&ccedil;&atilde;o do VSCode com o plugin da Red Hat que d&aacute; suporte &agrave; linguagens baseadas em XML &eacute; uma ferramenta de apoio insdispens&aacute;vel para o correto desenvolvimento das tarefas.</p>
		</li>
		<li style="text-align:justify">
		<p>A instala&ccedil;&atilde;o &eacute; muito simples!&nbsp;Para isso, abra a visualiza&ccedil;&atilde;o de &quot;Extens&otilde;es&quot; clicando no &iacute;cone &quot;Extens&otilde;es&quot; na Barra de atividades que fica&nbsp;na lateral esquerda do VSCode ou utilizando o atalho do teclado&nbsp;(Ctrl+Shift+X). Voc&ecirc; ver&aacute; uma lista das extens&otilde;es mais populares do VSCode no VSCode Marketplace. Na barra de pesquisa, digite <em>XML Language Suporte by Red Hat</em>. Para instalar a extens&atilde;o, clique no bot&atilde;o Instalar.</p>
		</li>
		<li style="text-align:justify">
		<p>A partir deste momento o VSCode dar&aacute; suporte &agrave; codifica&ccedil;&atilde;o da linguagem usando como base as regras b&aacute;sicas da linguagem XML e tamb&eacute;m com base no arquivo XML Schema que define a&nbsp;gram&aacute;tica da linguagem EvaML . Voc&ecirc; ter&aacute; suporte na defini&ccedil;&atilde;o da estrutura do documento, utiliza&ccedil;&atilde;o correta dos elementos dispon&iacute;veis em cada se&ccedil;&atilde;o do documento&nbsp;e poder&aacute; utilizar o recurso de autocompletar do VSCode atrav&eacute;s do atalho do teclado (Ctrl+Barra de espa&ccedil;o) durante a entrada dos comandos e atributos da linguagem.</p>
		</li>
	</ul>
	</li>
	<li style="text-align:justify">
	<p style="text-align:justify"><span style="color:#000000"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium">Parser EvaML e o&nbsp;simulador EvaSIM</span></span></span></p>

	<ul>
		<li style="text-align:justify">
		<p style="text-align:justify">A linguagem EvaML &eacute; uma linguagem para o desenvolvimento de sess&otilde;es interativas para o rob&ocirc; EVA. Como n&atilde;o &eacute; poss&iacute;vel neste momento ter um rob&ocirc; f&iacute;sico montado para os testes da linguagem, o c&oacute;digo escrito em EvaML ser&aacute; testado usando-se o simulador do rob&ocirc; EVA chamado EvaSIM. O EvaSIM, assim como o rob&ocirc; f&iacute;sico, n&atilde;o executa diretamente um c&oacute;digo escrito na linguagem EvaML, o simulador &eacute; capaz de executar o c&oacute;digo resultante do processo de parser da linguagem EvaML. O c&oacute;digo do parser da linguagem se encontra no arquivo &quot;eva_parser.py&quot;.</p>
		</li>
		<li style="text-align:justify">
		<p style="text-align:justify">Como dito anteriormente, o simulador EvaSIM&nbsp;&eacute; capaz de executar o c&oacute;digo resultante do processo de parser da linguagem EvaML e &eacute; esse c&oacute;digo que deve ser importado e executado no simulador .</p>
		</li>
		<li style="text-align:justify">
		<p style="text-align:justify">Para ter acesso ao simulador EvaSIM e ao parser EvaML baixe o arquivo zip na vers&atilde;o correta referente ao seu sistema operacional a partir deste <a href="https://github.com/midiacom/eva-robot/tree/master/EvaSIM%20Testing%20Version" target="_blank">link&nbsp;</a>. Voc&ecirc; ser&aacute; direcionado &aacute; uma p&aacute;gina contendo as instru&ccedil;&otilde;es para o download, execu&ccedil;&atilde;o e o teste inicial do EvaSIM.</p>
		</li>
	</ul>
	</li>
</ol>

<p style="text-align:justify">&nbsp;</p>

<p style="text-align:justify"><span style="color:#000000"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium">Para que a experi&ecirc;ncia no processo de desenvolvimento da tarefa seja a melhor poss&iacute;vel, ser&aacute; apresentada a seguir uma sequ&ecirc;ncia de passos que podem servir como um guia para a execu&ccedil;&atilde;o das tarefas. N&oacute;s partiremos do suposto que voc&ecirc; j&aacute; tem o ambiente de desenvolvimento corretamente configurado como indicado anteriormente.</span></span></span></p>

<ol>
	<li style="text-align:justify">
	<p><span style="color:#000000"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium">Voc&ecirc; de abrir o VSCode e no menu &quot;Arquivo&quot; clicar em importar &quot;pasta&quot;. Em seguida v&aacute; at&eacute; a pasta &quot;eva_sim&quot; e a selecione. O VSCode mostrar&aacute; o conte&uacute;do da pasta &quot;eva_sim&quot; com todos os seus arquivos. Caso voc&ecirc; n&atilde;o esteja vendo a &aacute;rvore do diret&oacute;rio no VSCode, use o atalho (Ctrl+Shift+E).</span></span></span></p>
	</li>
	<li style="text-align:justify">
	<p><span style="color:#000000; font-family:Montserrat,sans-serif; font-size:medium">Observando os arquivos atrav&eacute;s do explorer do VSCode, voc&ecirc; deve clicar no arquivo de template nomeado &quot;<em>my_script_file.xml</em>&quot;. Esse arquivo cont&eacute;m uma estrutura b&aacute;sica do documento no padr&atilde;o EvaML. &Eacute; neste arquivo que voc&ecirc; deve&nbsp;entrar o c&oacute;digo referente a execu&ccedil;&atilde;o das tarefas propostas neste teste.&nbsp;</span><span style="color:#000000; font-family:Montserrat,sans-serif; font-size:medium"><strong>Voc&ecirc; deve aproveitar o recurso de autocompletar do VSCode!</strong>&nbsp;Ele o ajudar&aacute; na utiliza&ccedil;&atilde;o correta dos elementos da linguagem. Por exemplo, ao digitar o caractere &quot;&lt;&quot; voc&ecirc; ver&aacute; uma lista dos elementos da linguagem que podem ou devem ser utilizados em cada se&ccedil;&atilde;o do seu documento EvaML. Da mesma maneira, ao entrar com um atributo tamb&eacute;m ser&aacute; apresentada uma lista com as op&ccedil;&otilde;es para cada atributo. Quando h&aacute; algum erro na estrutura do documento ou h&aacute; algum erro de digita&ccedil;&atilde;o que comprometa a boa forma&ccedil;&atilde;o do documento, a IDE procura indicar, da maneira mais precisa poss&iacute;vel, em que lugar do documento se encontra o erro. Ela faz isso, geralmente, sublinhando o local onde o erro est&aacute; ocorrendo com a cor vermelha.</span></p>
	</li>
	<li style="text-align:justify">
	<p><span style="color:#000000; font-family:Montserrat,sans-serif; font-size:medium">Para testar o c&oacute;digo que voc&ecirc; escreveu, como j&aacute; foi dito, ser&aacute; utilizado o simulador EvaSIM, mas para isso, &eacute; preciso transformar o c&oacute;digo do script que voc&ecirc; escreveu em um c&oacute;digo compat&iacute;vel com o simulador. Esse processo &eacute; feito utilizando-se o parser EvaML. Para ter acesso &agrave; linha de comando crie um novo &quot;terminal&quot; no VSCode atrav&eacute;s do menu &quot;Terminal&quot; ou atrav&eacute;s do atalho (Ctrl+Shift+&#39;). Um terminal se abrir&aacute; na parte inferior da IDE e j&aacute; estar&aacute; no diret&oacute;rio de trabalho, ou seja, no diret&oacute;rio referente &agrave; pasta &quot;eva_sim&quot;. Para executar o parser do c&oacute;digo digite no terminal o comando &quot;<em>python eva_parser.py my_script_file.xml -c</em>&quot;. Se o seu c&oacute;digo estiver no padr&atilde;o da linguagem EvaML, voc&ecirc; ver&aacute; no terminal, a indica&ccedil;&atilde;o de que as 4 etapas do parsing executaram corretamente&nbsp;e o parsing ter&aacute; criado o arquivo &quot;</span><span style="color:#000000"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium"><em>script01_EvaML.xml</em></span></span></span><span style="color:#000000; font-family:Montserrat,sans-serif; font-size:medium">&quot;.&nbsp; &Eacute; este o arquivo que dever&aacute; ser importado no EvaSIM na pr&oacute;xima etapa.</span></p>
	</li>
	<li style="text-align:justify">
	<p><span style="color:#000000"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium">Durante a etapa de configura&ccedil;&atilde;o do ambiente adequado (como foi sugerido) voc&ecirc; deve ter baixado e executado o simulador EvaSIM. Voc&ecirc; tamb&eacute;m deve ter ativado o simulador clicando no bot&atilde;o &quot;PowerOn&quot; no menu de bot&otilde;es do mesmo. Para que o simulador execute o c&oacute;digo gerado pelo parsing, voc&ecirc; precisa import&aacute;-lo no EvaSIM. Para isso, voc&ecirc; deve cliquar no bot&atilde;o &quot;Import File&quot; no menu de bot&otilde;es do simulador e selecionar, atrav&eacute;s da janela de di&aacute;logo de abertura de arquivo, o arquivo &quot;<em>script01_EvaML.xml&quot;.</em></span></span></span></p>
	</li>
	<li style="text-align:justify">
	<p><span style="color:#000000"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium">O pr&oacute;ximo passo &eacute; rodar o script carregado na mem&oacute;ria do EvaSIM e isso deve ser feito clicando no bot&atilde;o &quot;Run&quot; do simulador. Durante a execu&ccedil;&atilde;o do script, observe as mensagens no emulador de terminal do EvaSIM, elas podem ajud&aacute;-lo na verifica&ccedil;&atilde;o da l&oacute;gica do seu script. Acompanhe tamb&eacute;m as tabelas de mem&oacute;ria, que ficam &agrave; direita na interface do simulador, nelas voc&ecirc; pode visualisar o conte&uacute;do da mem&oacute;ria do EvaSIM. O simulador foi programado para emitir algumas mensagens de alerta e de&nbsp;erro em tempo de excu&ccedil;&atilde;o. Caso ocorra algum problema na execu&ccedil;&atilde;o do seu c&oacute;digo, volte para o VSCode e procure corrig&iacute;-lo, salvando-o e voltando novamente aos processos de parsing, importa&ccedil;&atilde;o e execu&ccedil;&atilde;o do script.</span></span></span></p>
	</li>
</ol>

<p style="text-align:justify">&nbsp;</p>

<p style="text-align:justify"><span style="color:#000000; font-family:Montserrat,sans-serif; font-size:medium">Seguindo as dicas indicadas at&eacute; aqui voc&ecirc; ser&aacute; capaz de executar as tarefas propostas a seguir. Boa sorte!</span></p>

<p style="text-align:justify">&nbsp;</p>

<p style="text-align:center"><u><span style="color:#000000"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium"><strong>Tarefa 1</strong></span></span></span></u></p>

<p>&nbsp;</p>

<p><span style="color:#000000"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium">Desenvolva uma sess&atilde;o para o rob&ocirc; EVA que fa&ccedil;a ele se apresentar para o usu&aacute;rio. Esta sess&atilde;o deve usar elementos de luz e som, deve utilizar o display do rob&ocirc; para expressar suas emo&ccedil;&otilde;es atrav&eacute;s do olhar e deve utilizar o recurso de </span></span></span><span style="color:#000000"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium"><em>Text-To-Speech</em></span></span></span><span style="color:#000000"> </span><span style="color:#000000"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium">(TTS) do rob&ocirc;, permitindo que o rob&ocirc; fale. Marque o tempo que levar&aacute; para executar esta tarefa.</span></span></span></p>

<p><span style="color:#000000"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium">Primeiro, defina o nome do script atrav&eacute;s do atributo </span></span></span><span style="color:#000000"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium"><em>name</em></span></span></span><span style="color:#000000"> </span><span style="color:#000000"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium">do elemento </span></span></span><span style="color:#9b59b6"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium">&lt;evaml&gt;</span></span></span><span style="color:#000000"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium">. Voc&ecirc; pode manter o mesmo nome que j&aacute; veio dentro do template. Em seguida, voc&ecirc; deve definir a voz do rob&ocirc; usando o comando </span></span></span><span style="color:#9b59b6"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium">&lt;voice&gt;</span></span></span><span style="color:#000000"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium">. Para ter acesso a algumas op&ccedil;&otilde;es de vozes dispon&iacute;veis, consulte a Tabela 2.3, na Se&ccedil;&atilde;o 2.3.1 do manual. Certifique-se de ativar os efeitos de luz e &aacute;udio na se&ccedil;&atilde;o </span></span></span><span style="color:#9b59b6"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium">&lt;settings&gt;</span></span></span><span style="color:#000000"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium">. A sequ&ecirc;ncia de a&ccedil;&otilde;es a serem executadas pelo rob&ocirc; &eacute; a seguinte.</span></span></span></p>

<p><span style="color:#000000"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium">Usando o comando </span></span></span><span style="color:#9b59b6"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium">&lt;evaEmotion&gt;</span></span></span><span style="color:#000000"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium">, fa&ccedil;a com que o olhar do rob&ocirc; fique com a express&atilde;o neutra. Com o comando </span></span></span><span style="color:#9b59b6"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium">&lt;light&gt;</span></span></span><span style="color:#000000"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium">, fa&ccedil;a com que o rob&ocirc; acenda a luz na cor branca. V&aacute; at&eacute; a pasta &ldquo;sonidos&rdquo;, que se encontra no diret&oacute;rio do parser EvaML e escolha um arquivo de &aacute;udio para ser tocado pelo rob&ocirc;. Utilizando o comando </span></span></span><span style="color:#9b59b6"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium">&lt;audio&gt;</span></span></span><span style="color:#000000"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium"> toque o arquivo de &aacute;udio escolhido como um som de abertura, antes do texto de apresenta&ccedil;&atilde;o do rob&ocirc;. Lembre-se de usar o atributo </span></span></span><span style="color:#000000"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium"><em>block=&rdquo;true&rdquo;</em></span></span></span><span style="color:#000000"> </span><span style="color:#000000"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium">para fazer com que o comando seguinte espere pelo fim do play do arquivo de &aacute;udio.</span></span></span></p>

<p><span style="color:#000000"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium">Agora, fa&ccedil;a com que o rob&ocirc; acenda a luz amarela e fique com a express&atilde;o de alegria. Em seguida, o rob&ocirc; deve se apresentar falando um texto. Esse texto deve conter 3 frases distintas, que ser&atilde;o selecionadas aleatoriamente a cada execu&ccedil;&atilde;o do script. Para isso, use o caractere &ldquo;/&rdquo; como separador das frases. Agora, acenda a luz rosa, fa&ccedil;a o rob&ocirc; ficar com o olhar neutro e finalize o script, fazendo com que a intera&ccedil;&atilde;o fique em pausa por 2 segundos, para isso, use o comando </span></span></span><span style="color:#9b59b6"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium">&lt;wait&gt;</span></span></span><span style="color:#000000"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium">. Salve o script, execute o parser EvaML, importe e rode o c&oacute;digo no simulador EvaSIM. Fique atento pois o atributo <em>name </em>do elemento raiz </span></span></span><span style="color:#9b59b6"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium">&lt;evaml&gt;</span></span></span><span style="color:#000000"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium"> do arquivo de template &eacute; &ldquo;<em>script01&rdquo;</em>, portanto, ap&oacute;s a execu&ccedil;&atilde;o do parser ser&aacute; gerado o arquivo &ldquo;<em>script01_EvaML.xml</em>&rdquo; e este &eacute; o arquivo que deve ser importado no simulador. Se o script n&atilde;o executar como planejado no EvaSIM, revise o seu c&oacute;digo XML para resolver qualquer problema. Salve o c&oacute;digo XML final da tarefa 1, pois ser&aacute; necess&aacute;rio utiliz&aacute;-lo para a tarefa 2. Lembre-se de marcar o tempo que levar&aacute; para executar esta tarefa.</span></span></span></p>

<p><br />
&nbsp;</p>

<p style="text-align:center"><span style="color:#000000"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium"><strong>Tarefa 2</strong></span></span></span><br />
&nbsp;</p>

<p style="text-align:justify"><span style="color:#000000"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium">Dando continuidade ao script criado na tarefa 1, o objetivo da tarefa 2 &eacute; fazer com que o rob&ocirc; interaja com o usu&aacute;rio via voz para obter o seu nome e perguntar se ele deseja jogar um jogo. Marque o tempo que levar&aacute; para executar esta tarefa.</span></span></span></p>

<p style="text-align:justify"><span style="color:#000000"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium">Primeiro, o rob&ocirc; dever&aacute; obter o nome do usu&aacute;rio. Para isso ele deve fazer a pergunta falando e em seguida obter a resposta do usu&aacute;rio. Em seguida, o rob&ocirc; deve saudar o usu&aacute;rio pelo nome obtido anteriormente e dizer que vai apresentar suas emo&ccedil;&otilde;es. O rob&ocirc; dever&aacute; apresentar suas emo&ccedil;&otilde;es com o olhar, seguido de uma descri&ccedil;&atilde;o verbal da emo&ccedil;&atilde;o apresentada. Apresente as 3 emo&ccedil;&otilde;es (alegria, tristeza e raiva). Ap&oacute;s a apresenta&ccedil;&atilde;o das 3 emo&ccedil;&otilde;es fa&ccedil;a com que o olhar do rob&ocirc; fique com express&atilde;o neutra.</span></span></span></p>

<p style="text-align:justify"><span style="color:#000000"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium">Vamos, ainda nesta tarefa, fazer a introdu&ccedil;&atilde;o do &ldquo;Jogo da Imita&ccedil;&atilde;o&rdquo;, um Jogo S&eacute;rio que usa a capacidade de reconhecimento de express&otilde;es faciais do EVA. Este jogo ser&aacute; implementado na tarefa 3.</span></span></span></p>

<p style="text-align:justify"><span style="color:#000000"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium">Seguindo com a codifica&ccedil;&atilde;o da sequ&ecirc;ncia de a&ccedil;&otilde;es, fa&ccedil;a com que o rob&ocirc; pergunte ao usu&aacute;rio se ele quer jogar o Jogo da Imita&ccedil;&atilde;o. A resposta deve ser </span></span></span><span style="color:#000000"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium"><em>sim</em></span></span></span><span style="color:#000000"> </span><span style="color:#000000"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium">ou </span></span></span><span style="color:#000000"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium"><em>n&atilde;o</em></span></span></span><span style="color:#000000"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium">. Obtenha a resposta do usu&aacute;rio. Usando o comando </span></span></span><span style="color:#9b59b6"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium">&lt;switch</span></span></span><span style="color:#000000"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium"> </span></span></span><span style="color:#3498db"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium">var</span></span></span><span style="color:#000000"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium">=&rdquo;$&rdquo;</span></span></span><span style="color:#9b59b6"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium">&gt;</span></span></span><span style="color:#000000"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium">, insira dois comandos </span></span></span><span style="color:#9b59b6"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium">&lt;case&gt;</span></span></span><span style="color:#000000"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium"> para tratar as respostas </span></span></span><span style="color:#000000"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium"><em>sim/n&atilde;o</em></span></span></span><span style="color:#000000"> </span><span style="color:#000000"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium">do usu&aacute;rio. Se o usu&aacute;rio responder </span></span></span><span style="color:#000000"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium"><em>sim,</em></span></span></span><span style="color:#000000"> </span><span style="color:#000000"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium">fa&ccedil;a o rob&ocirc; expressar um olhar de alegria e falar uma frase de entusiasmo por conta do usu&aacute;rio ter aceitado jogar o jogo. Caso o usu&aacute;rio diga </span></span></span><span style="color:#000000"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium"><em>n&atilde;o</em></span></span></span><span style="color:#000000"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium">, fa&ccedil;a o rob&ocirc; expressar um olhar de tristeza despedindo-se do usu&aacute;rio, falando uma frase lamentando o ocorrido e apagando a luz. Ap&oacute;s a fala, ainda no bloco </span></span></span><span style="color:#9b59b6"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium">&lt;case&gt;</span></span></span><span style="color:#000000"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium">, que trata a resposta </span></span></span><span style="color:#000000"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium"><em>n&atilde;o</em></span></span></span><span style="color:#000000"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium">, insira o comando que interrompe a execu&ccedil;&atilde;o do script. Voc&ecirc; pode fechar o bloco </span></span></span><span style="color:#9b59b6"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium">&lt;switch&gt;</span></span></span><span style="color:#000000"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium">, salvar o c&oacute;digo e executar o parser EvaML e rodar no simulador EvaSIM. Se tudo estiver certo, voc&ecirc; pode partir para a tarefa 3, caso contr&aacute;rio, revise o seu c&oacute;digo XML para resolver qualquer problema. Salve o c&oacute;digo XML final da tarefa 2, pois ser&aacute; necess&aacute;rio utiliz&aacute;-lo para a tarefa 3. Lembre-se de marcar o tempo que levar&aacute; para executar esta tarefa.</span></span></span></p>

<p>&nbsp;</p>

<p><span style="color:#000000"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium"><strong>Observa&ccedil;&atilde;o 1</strong></span></span></span><span style="color:#000000"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium">: Para entender melhor a utiliza&ccedil;&atilde;o do caractere $, veja a Se&ccedil;&atilde;o 2.3.4 do manual e observe a Figura 2.2.</span></span></span></p>

<p>&nbsp;</p>

<p><span style="color:#000000"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium"><strong>Observa&ccedil;&atilde;o 2</strong></span></span></span><span style="color:#000000"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium">: No EvaSIM, use o emulador de terminal para acompanhar as a&ccedil;&otilde;es sendo executadas pelo &ldquo;rob&ocirc;&rdquo;, e verifique as tabelas de vari&aacute;veis para conferir os valores de retorno dos comandos </span></span></span><span style="color:#9b59b6"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium">&lt;random&gt;</span></span></span><span style="color:#000000"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium"> e </span></span></span><span style="color:#9b59b6"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium">&lt;listen&gt;</span></span></span><span style="color:#000000"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium"> que podem ser referenciados utilizando-se o caractere $.</span></span></span></p>

<p><br />
&nbsp;</p>

<p style="text-align:center"><span style="color:#000000"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium"><strong>Tarefa 3</strong></span></span></span></p>

<p>&nbsp;</p>

<p style="text-align:justify"><span style="color:#000000"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium">A &uacute;ltima tarefa implementa o Jogo da Imita&ccedil;&atilde;o. O jogo dever&aacute; funcionar da seguinte maneira. O rob&ocirc; deve explicar ao usu&aacute;rio que ir&aacute; apresentar algumas emo&ccedil;&otilde;es. Ao todo, ser&atilde;o 3 emo&ccedil;&otilde;es apresentadas (tristeza, alegria ou raiva) e elas devem ser apresentadas </span></span></span><span style="color:#000000"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium"><em>aleatoriamente</em></span></span></span><span style="color:#000000"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium">. Para as emo&ccedil;&otilde;es de tristeza, alegria e raiva, acenda a l&acirc;mpada nas cores azul, verde e vermelha, respectivamente. Em seguida, o rob&ocirc; deve </span></span></span><span style="color:#000000"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium"><u>pedir ao usu&aacute;rio para imit&aacute;-lo. O rob&ocirc;, ent&atilde;o, deve detectar a express&atilde;o facial do usu&aacute;rio</u></span></span></span><span style="color:#000000"> </span><span style="color:#000000"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium">e verificar se o usu&aacute;rio conseguiu imit&aacute;-lo. Este processo deve ser repetido 3 vezes e, ao final, o rob&ocirc; deve dizer quantas vezes o usu&aacute;rio imitou sua express&atilde;o facial corretamente. Marque o tempo que levar&aacute; para executar esta tarefa.</span></span></span></p>

<p style="text-align:justify"><span style="color:#000000"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium">Para detectar a express&atilde;o facial do usu&aacute;rio, use o comando </span></span></span><span style="color:#9b59b6"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium">&lt;userEmotion&gt;</span></span></span><span style="color:#000000"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium">. Caso o usu&aacute;rio tenha imitado corretamente, </span></span></span><span style="color:#000000"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium"><u>o rob&ocirc; deve expressar alegria, falar uma frase de congratula&ccedil;&atilde;o e um ponto deve ser adicionado ao </u></span></span></span><span style="color:#000000"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium"><em><u>score</u></em></span></span></span><span style="color:#000000"><u> </u></span><span style="color:#000000"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium"><u>do jogo</u></span></span></span><span style="color:#000000"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium">. No caso do usu&aacute;rio n&atilde;o conseguir imitar o rob&ocirc;, o EVA deve </span></span></span><span style="color:#000000"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium"><u>expressar tristeza e falar uma frase dizendo que o usu&aacute;rio errou</u></span></span></span><span style="color:#000000"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium">. Em seguida, o rob&ocirc; reinicia o processo, apresentando outra emo&ccedil;&atilde;o selecionada aleatoriamente. Ao todo, devem ser apresentadas 3 emo&ccedil;&otilde;es, ou seja, o processo se repete 3 vezes. Ap&oacute;s as 3 rodadas de emo&ccedil;&otilde;es, o rob&ocirc; deve expressar alegria, apresentar (falando) o </span></span></span><span style="color:#000000"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium"><em>score</em></span></span></span><span style="color:#000000"> </span><span style="color:#000000"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium">do jogo e por fim, falar um texto se despedindo do usu&aacute;rio. O nome do usu&aacute;rio, obtido na tarefa 2, deve ser citado no texto. Para isso use o caractere $ seguido do &iacute;ndice que pode acessar o segundo elemento armazenado na mem&oacute;ria do EVA.</span></span></span></p>

<p style="text-align:justify"><span style="color:#000000"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium">Observe que duas vari&aacute;veis devem ser criadas, a primeira deve conter o </span></span></span><span style="color:#000000"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium"><em>score</em></span></span></span><span style="color:#000000"> </span><span style="color:#000000"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium">do jogo. A segunda deve controlar o n&uacute;mero de rodadas do jogo. Fique atento aos trechos de c&oacute;digos que podem se repetir nos 3 fluxos aleat&oacute;rios. Voc&ecirc; pode definir algumas </span></span></span><span style="color:#000000"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium"><em>macros</em></span></span></span><span style="color:#000000"> </span><span style="color:#000000"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium">que podem, al&eacute;m de reduzir a quantidade de c&oacute;digo digitado, deixar o script mais leg&iacute;vel. As partes do texto sublinhadas indicam as sequ&ecirc;ncias de a&ccedil;&otilde;es que podem ser definidas em 3 macros.</span></span></span></p>

<p style="text-align:justify"><span style="color:#000000"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium">Ap&oacute;s a finaliza&ccedil;&atilde;o da codifica&ccedil;&atilde;o da tarefa em XML, execute o parser EvaML, importe o c&oacute;digo no simulador EvaSIM e verifique se o c&oacute;digo se comporta como o esperado. Se o script n&atilde;o executar como planejado no EvaSIM, revise o seu c&oacute;digo XML para resolver qualquer problema. Salve o c&oacute;digo XML final da tarefa 3, pois ser&aacute; necess&aacute;rio fazer upload deste c&oacute;digo posteriormente. Lembre-se de marcar o tempo que levar&aacute; para executar esta tarefa.</span></span></span></p>

<p style="text-align:justify">&nbsp;</p>

<p><span style="color:#000000"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium"><strong>Observa&ccedil;&atilde;o 3</strong></span></span></span><span style="color:#000000"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium">: O arquivo que deve ser enviado &eacute; o arquivo &quot;<em>my_script_file.xml</em>&quot;.</span></span></span></p>

<p>&nbsp;</p>

<p>&nbsp;</p>

<p style="text-align:center"><span style="color:#000000"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium"><strong>Question&aacute;rio de Avalia&ccedil;&atilde;o</strong></span></span></span></p>

<p><br />
&nbsp;</p>

<p style="text-align:justify"><span style="color:#000000"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium">Ao finalizar as 3 tarefas, responda o question&aacute;rio sobre a linguagem EvaML e o simulador EvaSIM dispon&iacute;vel em: </span></span></span><a href="https://forms.gle/zg3fBnhEbtWFZjnF8" target="_blank"><span style="color:#1155cc"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium"><u>EvaML e EvaSIM - Teste de Usabilidade</u></span></span></span></a></p>

<p><br />
&nbsp;</p>

<p style="text-align:center"><strong><span style="color:#000000"><span style="font-family:Montserrat,sans-serif"><span style="font-size:medium">Muito obrigado por participar do experimento!</span></span></span></strong></p>

<p><br />
<br />
&nbsp;</p>
